Repository: UniversityofHelsinki/sp-registry
Catalog: auth/locale/*/LC_MESSAGES/django.po
Languages: fi

source: API keys may be used to access SP-registry REST API.
fi: API-avainta käytetään pääsytunnisteena SP-rekisterin REST APIin.

source: Show API schema.
fi: Näytä API-skeema

source: Show API key
fi: Näytä API-avain

source: API key is:
fi: API-avain on:

source: Include in the Authorization HTTP header, i.e.
fi: Sisällytä tunniste Authroziation HTTP osikkoon, esim.

source: You do not currently have an API key.
fi: Teillä ei tällä hetkellä ole API-avainta.

source: Reset key
fi: Vaihda avain

source: Remove key
fi: Poista avain

source: Create key
fi: Luo avain

source: Service Provider Registry
fi: Palveluntarjoajarekisteri

source: University of Helsinki
fi: Helsingin yliopisto

source: You have already logged in
fi: Olet jo kirjautunut sisään

source: Logout
fi: Kirjaudu ulos

source: Login using Single Sign-On
fi: Kirjaudu käyttäen kertakirjautumista

source: Login using a local account
fi: Kirjaudu käyttäen paikallista tunnusta

source: Use this only if you do not have University of Helsinki user account.
fi: Käytä tätä vain, jos teillä ei ole Helsingin yliopiston käyttäjätunnusta.

source: Submit
fi: Lähetä

source: Lost password? Reset it here. You may use same form to get forgotten username.
fi: Salasana hukassa? Palauta se täällä. Voit käyttää samaa lomaketta palauttaaksesi unohdetun käyttäjätunnuksen.

source: Data privacy information of the service
fi: Palvelun tietosuojatiedote

source: This site uses cookies to save session information between page changes. By logging in to the site, you are agreeing to our use of cookies.
fi: Tämä sivusto käyttää evästeitä tallentaakseen istuntotietoja sallien mm. sivulta toiselle siirtymisen. Kirjautumalla hyväksyt evästeiden käytön tähän tarkoitukseen.

source: You have logged out
fi: Olet kirjautunut ulos

source: Login
fi: Kirjaudu sisään

source: Reset password
fi: Palauta salasana

source: Password has been reset successfully.
fi: Salasana on palautettu onnistuneesti.

source: Log in.
fi: Kirjaudu sisään.

source: Password reset failed.
fi: Salasanan palautus epäonnistui.

source: Please follow the instructions in the email to reset your password.
fi: Ole hyvä ja seuraa sähköpostitse saamiasi ohjeita salasanan palautukseen.

source: You're receiving this email because you requested a password reset for your user account at
fi: Saat tämän viestin, koska pyysit salasanan palautusta käyttäjätilillesi

source: Your username, in case you've forgotten:
fi: Käyttäjätunnuksesi, jos olet unohtanut sen:

source: If you did not request a password reset, please ignore this email.
fi: Jos et pyytänyt salasanan palautusta, voit jättää tämän viestin huomiotta.

source: Please go to the following page and choose a new password:
fi: Ole hyvä ja mene seuraavalle sivulle valitsemaan uusi salasana:

source: Instructions for resetting password will be send to your email.
fi: Ohjeet salasanan palautukseen lähetetään sähköpostiisi.
