Repository: UniversityofHelsinki/sp-registry
Catalog: rr/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Endpoint Type
fi: Yhteysosoitteen tyyppi

source: Binding
fi: Muoto

source: Location
fi: Osoite

source: ResponseLocation
fi: Vastausosoite

source: Index
fi: Järjestys

source: isDefault
fi: Oletus

source: Name Identifier Format
fi: Name Identifierin muoto

source: Show in list
fi: Näytetään listassa

source: Response type
fi: Vastaustyyppi

source: Organization Name (Finnish)
fi: Organisaation nimi (suomi)

source: Organization Name (English)
fi: Organisaation nimi (englanti)

source: Organization Name (Swedish)
fi: Organisaation nimi (ruotsi)

source: Organization Description (Finnish)
fi: Organisaation kuvaus (suomi)

source: Organization Description (English)
fi: Organisaation kuvaus (englanti)

source: Organization Description (Swedish)
fi: Organisaation kuvaus (ruotsi)

source: Organization URL (Finnish)
fi: Organisaation URL (suomi)

source: Organization URL (English)
fi: Organisaation URL (englanti)

source: Organization URL (Swedish)
fi: Organisaation URL (ruotsi)

source: Privacy Policy URL (Finnish)
fi: Tietosuojaseloste URL (suomi)

source: Privacy Policy URL (English)
fi: Tietosuojaseloste URL (englanti)

source: Privacy Policy URL (Swedish)
fi: Tietosuojaseloste URL (ruotsi)

source: Enter a valid URI.
fi: URIn muoto on virheellinen.

source: URI already exists
fi: URI on jo olemassa

source: Web application URIs must begin with https: scheme
fi: Web-sovellusten URIn täytyy alkaa https: -skeemalla

source: URIs must not contain fragments
fi: URI ei saa sisältää #-merkin jälkeisiä tarkenteita

source: Native applications must use custom URI schemes or http: scheme with localhost as the hostname.
fi: Sovellusten URIn täytyy käyttää omaa URI-skeemaa tai http: -skeemaa localhost-osoitteella.

source: Redirect URI
fi: Paluuosoite (Redirect URI)

source: Service type (SAML/LDAP)
fi: Palvelun tyyppi (SAML/LDAP)

source: Organization
fi: Organisaatio

source: Service Name (Finnish)
fi: Palvelun nimi (suomi)

source: Service Name (English)
fi: Palvelun nimi (englanti)

source: Service Name (Swedish)
fi: Palvelun nimi (ruotsi)

source: Service Description (Finnish)
fi: Palvelun kuvaus (suomi)

source: Service Description (English)
fi: Palvelun kuvaus (englanti)

source: Service Description (Swedish)
fi: Palvelun kuvaus (ruotsi)

source: Privacy Policy URLs from Organization
fi: Tietosuojaselosteet organisaatiotiedoista

source: Service Login Page URL
fi: Palvelun kirjautumisosoite

source: Application portfolio URL
fi: Palvelun tiedot Sovellussalkussa (URL)

source: Additional notes
fi: Lisätietoja

source: Admin notes
fi: Ylläpitäjän huomioita

source: Discovery Service URL
fi: Discovery-palvelun osoite

source: Sign SSO assertions
fi: Allekirjoita SSO-vahvistukset (assertions)

source: Sign SSO requests
fi: Allekirjoita SSO-pyynnöt

source: Sign SSO responses
fi: Allekirjoita SSO-vastaukset

source: Encrypt SSO assertions
fi: Salaa SSO-vahvistukset (assertions)

source: Require MFA authentication
fi: Vaadi vahvaa tunnistusta

source: Use SHA-1 as signature algorithm
fi: Käytä SHA-1-algoritmia allekirjoituksiin

source: Force use of specific nameIDFormat
fi: Pakota tietty nameIDFormat päälle

source: Client secret
fi: Palvelun salaisuus

source: URL for the JSON Web Key Set
fi: JSON Web Key Set -osoite

source: native
fi: natiivi

source: Application type
fi: Palvelun tiedot Sovellussalkussa (URL)

source: Token endpoint authentication method
fi: Tunniste-yhteysosoitteen kirjautumismetodi

source: This service requires manual configuration
fi: Palvelu vaatii käsin tehtyjä muutoksia

source: Publish to production servers
fi: Julkaise tuotantopalvelimille

source: Publish to test servers
fi: Julkaise testipalvelimille

source: SAML product this service is using
fi: Palvelun käyttämä SAML-tuote

source: SP updates IdP metadata automatically
fi: SP päivittää IdP-metatiedot automaattisesti

source: Does this service use the LDAPAuth proxy?
fi: Käyttääkö tämä palvelu LDAPAuthia?

source: Server names (not IPs), one per line
fi: Palvelimien nimet (DNS-nimet, ei IP:t), yksi per rivi

source: University of Helsinki users
fi: Helsingin yliopiston käyttäjät

source: Restricted user group
fi: Rajattu käyttäjäryhmä

source: Target group for the service
fi: Palvelun kohderyhmä

source: Does the service use a service account?
fi: Käyttääkö palvelu palvelutunnusta?

source: Email address and phone number for delivering the service account credentials
fi: Sähköpostiosoite ja puhelinnumero palvelutunnuksen toimittamista varten

source: Service requires access to all LDAP groups
fi: Palvelu tarvitsee pääsyn kaikkin LDAP-ryhmiin

source: Service stores a local copy of users and their information
fi: Palvelu tallentaa paikallisesti käyttäjät ja heidän tietojaan

source: Service stores a local copy of user passwords
fi: Palvelu tallentaa paikallisesti käyttäjien salasanat

source: How is this service storing the saved passwords and why?
fi: Kuinka palvelu tallentaa käyttäjien salasanat ja miksi?

source: Service stores a local copy of groups and group members
fi: Palvelu tallentaa paikallisesti kopion ryhmistä ja ryhmien jäsenistä

source: Modified
fi: Muokattu

source: History key
fi: Historia-avain

source: Updated by
fi: Päivittäjä

source: Invalid decryption key, could not show the client secret.
fi: Virheellinen salausavain, ei voida näyttää palvelun salaisuutta.

source: Reason for the attribute requisition
fi: Syy tietojen pyytämiseen

source: Creator
fi: Luoja

source: Activation key
fi: Aktivaatiotunnus

source: Valid until date
fi: Voimassaolo

source: Email address
fi: Sähköpostiosoite

source: Number of logins
fi: Kirjautumisten määrä

source: Number of unique users
fi: Yksilöllisten käyttäjien määrä

source: Login date
fi: Kirjautumispäivä

source: Login name
fi: Käyttäjätunnus

source: Password
fi: Salasana

source: First name
fi: Etunimi

source: Last name
fi: Sukunimi

source: Valid for selected SPs
fi: Hyväksytty valittuihin palveluihin

source: Attribute value
fi: Attribuutin arvo

source: Only letters, numbers and a dot allowed.
fi: Sallittu kirjauimet, numerot ja piste-merkki.

source: Finnish name is required.
fi: Palvelun nimi suomeksi vaaditaan.

source: No permissions for SP
fi: Ei oikeutta palveluun

source: Attribute Test Service
fi: Attribuuttien testipalvelu

source: Attribute test service
fi: Attribuuttien testipalvelu

source: This service lists all attributes that can be released to service providers by the login service.
fi: Tämä palvelu listaa kaikki tiedot, joita käyttäjästä on saatavilla keskitetyn kirjautumispalvelun kautta.

source: Some deprecated attributes may be hidden from the view if they don't contain any value for you.
fi: Osa käytöstä poistuvista attribuuteista on piilotettu näkymästä, jos ne eivät sisällä mitään arvoa teillä.

source: Following icons are used to represent the status of each attribute:
fi: Seuraavia kuvakkeita käytetään näyttämään attribuutin status:

source: Icon
fi: Ikoni

source: Description
fi: Salauksen purkaminen

source: Attribute was released and it has a seemingly correct value.
fi: Attribuutti julkaistiin ja sen arvo vaikuttaa oikeanlaiselta.

source: Attribute marked as a mandatory was not released or the attribute's value is not within the accepted value range.
fi: Attribuutti oli merkattu pakolliseksi, mutta sitä ei julkaistu tai sen arvo ei ollut hyväksyttävä.

source: This attribute is an optional and doesn't have any value for you. Not all attributes are available for all users.
fi: Tämä attribuutti on vapaaehtoinen eikä sillä ollut arvoa teille. Kaikkia attribuutteja ei ole saatavilla kaikille käyttäjille.

source: In case the attribute values are incorrect or a required attribute was not released, please contact
fi: Jos joukossa on vääriä tietoja tai vaaditulla attribuutilla ei ole arvoa, ole yhteyttä

source: Helpdesk
fi: Helpdeskiin

source: Authentication context
fi: Autentikointitapa

source: Context
fi: Konteksti

source: Value
fi: Arvo

source: You have logged in using single-factor authentication.
fi: Olet kirjautunut käyttäen yksivaiheista tunnistusta.

source: Login using multi-factor authentication
fi: Kirjaudu käyttäen vahvennettua tunnistusta.

source: You have logged in using multi-factor authentication.
fi: Olet kirjautunut käyttäen vahvennettua tunnistusta.

source: Login using single-factor authentication
fi: Kirjaudu käyttäen yksivaiheista tunnistusta.

source: Attributes
fi: Attribuutit

source: Attribute
fi: Attribuutti

source: Value format (regex)
fi: Arvon muoto (regex)

source: Logout using Single Logout
fi: Kirjaudu ulos käyttäen kertauloskirjautumista

source: Service Provider Registry
fi: SP-rekisteri

source: Top navigation bar
fi: Ylävalikko

source: SP Registry
fi: SP-rekisteri

source: Service Providers
fi: Palvelut

source: SP Configuration
fi: Palvelun asetukset

source: Summary
fi: Yhteenveto

source: Basic Information
fi: Perustiedot

source: Technical Attributes
fi: Tekniset tiedot

source: Certificates
fi: Varmenteet

source: SAML Endpoints
fi: SAML-yhteysosoitteet

source: User Groups
fi: Käyttäjäryhmät

source: Redirect URIs
fi: Paluuosoite

source: Contacts
fi: Yhteystiedot

source: Admins
fi: Ylläpitäjät

source: Test users
fi: Testikäyttäjät

source: View Metadata
fi: Näytä metatiedot

source: Login Statistics
fi: Kirjautumistilastot

source: Administration
fi: Hallinta

source: SAML Special Configs
fi: Poikkeavat SAML-asetukset

source: SAML Login Summary
fi: SAML-kirjautumistilastot

source: Emails
fi: Sähköpostit

source: Manage SAML metadata
fi: Hallitse SAML-metatietoja

source: Manage LDAP metadata
fi: Hallitse LDAP-metatietoja

source: Manage OIDC metadata
fi: Hallitse OIDC-metatietoja

source: Database Admin
fi: Django-hallinta

source: Logout
fi: Kirjaudu ulos

source: Login
fi: Kirjautuminen sisään

source: Side navigation bar
fi: Sivuvalikko

source: Test Users
fi: Testikäyttäjät

source: Error
fi: Virhe

source: An error occurred
fi: Virhe

source: Could not log in
fi: Palveluun kirjautuminen ei onnistunut

source: Your identity provider does not support multi-factor authentication.
fi: Käyttämänne identiteetintarjoaja ei tue monivaiheista tunnistautumista.

source: Single sign-on process returned an error.
fi: Kertakirjautumisessa tapahtui virhe.

source: Please try again using your browser's incognito-mode.
fi: Yritä uudelleen selaimen yksityisyys-tilassa.

source: If the problem persists, contact the application administrator directly or through IT Helpdesk.
fi: Jos ongelma jatkuu, ota yhteyttä palvelun ylläpitäjään joko suoraan tai IT Helpdeskin kautta.

source: Please include the following information in your message:
fi: Sisällytä yhteydenottoon seuraavat tiedot:

source: Bad request
fi: Virheellinen pyyntö

source: We do not understand you. Are you trying to hack us?
fi: Emme ymmärrä teitä, yritättekö hakkeroida meitä?

source: Return to previous page
fi: Palaa edelliselle sivulle

source: Permission denied
fi: Pääsy evätty

source: You have insufficient user rights to access this page.
fi: Käyttoikeutesi eivät riitä pyydettyyn toimintoon.

source: Page not found
fi: Sivua ei löydy

source: The page you are looking for does not exist or you have insufficient permissions for it.
fi: Sivua ei löydy tai käyttöoikeutenne eivät riitä sen näyttämiseen.

source: Internal error
fi: Sisäinen virhe

source: Something went wrong. Error has been logged and we will investigate it.
fi: Jotain meni pieleen. Virhe on kirjattu ja selvitämme mistä se johtui.

source: For your information
fi: Tiedoksenne

source: Listing all attributes included in this system.
fi: Listataan kaikki tunnetut attribuutit.

source: Click attribute ID for more information.
fi: Klikkaa attribuutti-ID:tä saadaksesi lisätietoja.

source: Friendly name
fi: Selväkielinen nimi

source: OID / Name
fi: OID / Nimi

source: Public attribute for SAML.
fi: Julkinen attribuutti SAML-palveluille.

source: Public attribute for LDAP.
fi: Julkinen attribuutti LDAP-palveluille.

source: Public attribute for OIDC.
fi: Julkinen attribuutti OIDC-palveluille.

source: No attributes
fi: Ei attribuuttia

source: Friendly Name
fi: Selväkielinen nimi

source: Name / OID
fi: Nimi / OID

source: Name Format
fi: Nimen muoto

source: LDAP attribute group
fi: LDAP-attribuuttiryhmät

source: Public SAML
fi: Julkinen, SAML

source: Public LDAP
fi: Julkinen, LDAP

source: Public OIDC
fi: Julkinen, OIDC

source: Scoped
fi: Päätteellinen

source: Information
fi: Lisätietoja

source: Edit in Django admin view
fi: Muokkaa tietoja Django-hallinnassa

source: Service Providers using the attribute
fi: Palvelut, jotka käyttävät tätä attribuuttia

source: SP
fi: Palvelu

source: Prod
fi: Tuotanto

source: Test
fi: Testi

source: Reason
fi: Syy

source: Contact
fi: Yhteystieto

source: Validated
fi: Hyväksytty

source: Give reasons for the attribute requisitions. Remove reason to remove requisition.
fi: Anna syy attribuutin luovutukseen. Poista syy poistaaksesi luovutuspyynnön.

source: Attributes with green border are validated and attributes with red border still need to be validated.
fi: Vihreällä reunuksella korostetut attribuutit on hyväksytty. Punaisella korostetut odottavat hyväksymistä.

source: For more information about attributes, visit the external info page:
fi: Lisää tietoja attribuuteista (ulkoinen sivusto):

source: instructions_url_attributes
fi: https://wiki.helsinki.fi/pages/viewpage.action?pageId=226580829

source: Attribute list
fi: Attribuuttilista

source: Save
fi: Tallenna

source: You need at least one certificate for signing SAML messages between SP and IdP. It's possible to use the same certificate for both signing and encryption.
fi: Tarvitset ainakin yhden varmenteen SAML-viestien allekirjoitukseen palvelun ja IdP:n välillä. Allekirjoitukseen ja salaukseen voi tarvittaessa käyttää samaa varmennetta.

source: It's highly recommended to use different certificate for signing and encrypting SAML messages than the certificate that is used for encrypting HTTPS traffic.
fi: On erittäin suositeltavaa käyttää eri varmennetta SAML-viestien allekirjoitukseen ja salaukseen kuin mitä käytetään HTTPS-liikenteen salaamiseen.

source: You may well use self-signed certificate for SAML messages. You may create a self-signed certificate using the following openssl command, using hostname sp1.test.helsinki.fi as an example.
fi: Voit hyvin käyttää itse allekirjoitettua varmennetta SAML-viestien allekirjoitukseen ja salaukseen. Voit luoda itse allekirjoitetun varmenteen esimerkiksi openssl-komennolla käyttäen seuraavaa esimerkkiä.

source: List of certificates
fi: Lista varmenteista.

source: Subject
fi: Otsikko

source: Signing
fi: Allekirjoitus

source: Encryption
fi: Salaus

source: Remove
fi: Poista

source: Mark for removal
fi: Merkitse poistettavaksi

source: Remove selected
fi: Poista valitut

source: Confirm removal
fi: Vahvista poisto

source: Do you want to remove selected certificates?
fi: Haluatko poistaa valitut varmenteet?

source: Cancel
fi: Peru

source: Confirm
fi: Vahvista

source: No certificates
fi: Ei varmenteita

source: Add certificate
fi: Lisää varmenne

source: You cannot have more than two certificates
fi: Palvelulla ei voi olla yli kahta varmennetta

source: Certificate administration
fi: Varmenteiden hallinta

source: Expired certificates
fi: Vanhentuneet varmenteet

source: Weak certificates
fi: Heikot varmenteet

source: Certificate information
fi: Varmenteen tiedot

source: Certificate name
fi: Varmenteen nimi

source: Issuer
fi: Myöntäjä

source: Key Size
fi: Avaimen koko

source: Serial number
fi: Sarjanumero

source: Fingerprint
fi: Sormenjälki

source: You need to specify at least the technical contact for a production use.
fi: Tarvitset ainakin teknisen yhteystiedon tuotantokäyttöön.

source: It's recommend that you use service addresses, not personal addresses. These contacts are used if the IdP administrators have to contact you about the SP or some client request has to be forwarded to you.
fi: On suositeltavaa käyttää palvelu-/ryhmäosoitteita, ei henkilökohtaisia sähköpostiosoitteita. Näitä yhteystietoja käytetään kirjautumispalveluiden ylläpitäjien toimesta, jos teihin täytyy ottaa yhteyttä palveluun liittyen.

source: List of contacts
fi: Lista yhteystiedoista

source: Type
fi: Tyyppi

source: Do you want to remove selected contacts?
fi: Haluatko poistaa valitut yhteystiedot?

source: No contacts
fi: Ei yhteystietoja

source: Add contact
fi: Lisää yhteystieto

source: Emails have been sent.
fi: Sähköpostit on lähetetty.

source: Sending errors.
fi: Lähetysvirheet.

source: Sending failed to following addresses:
fi: Lähetys epäonnistui seuraaviin osoitteisiin:

source: List emails / Show message
fi: Listaa sähköpostiosoitteet / Näytä viesti

source: Send email
fi: Lähetä sähköpostit

source: Message
fi: Viesti

source: Email addresses
fi: Sähköpostiosoitteet

source: Address
fi: Osoite

source: Endpoints
fi: Yhteysosoitteet

source: Endpoints are communication addresses to the SP. Any request sent to the IdP by the SP includes a return address. That address must be in this list or the request results in error.
fi: Yhteysosoitteet ovat osoitteita, johon SP vastaanottaa viestejä IdP:ltä. Kaikki IdP:lle lähetetyt pyynnöt sisältävät paluuosoitteen. Osoitteen täytyy löytyä yhteysosoitteiden listasta, muutoin pyyntö palauttaa virheen. Yhteysosoitteen muoto on koko URL, sisältäen protokollan ja polun.

source: In most cases you only have to specify AssertionConsumerService with HTTP-POST binding.
fi: Useimmissa tapauksissa tarvitsee määrittää vain HTTP-POST-muodon AssertionConsumerService-osoite.

source: If the service supports Single Logout Service, you should also specify endpoint for that.
fi: Jos palvelu tukee kertauloskirjautumista (SLO), on suositeltavaa lisätä yhteysosoite myös sille.

source: List of endpoints
fi: Yhteysosoitteiden lista

source: Response:
fi: Vastausosoite:

source: default
fi: oletus

source: Do you want to remove selected endpoints?
fi: Haluatko poistaa valitut yhteysosoitteet?

source: No endpoints
fi: Ei yhteysosoitteita

source: Add endpoint
fi: Lisää yhteysosoite

source: University of Helsinki - Service Provider Registry
fi: Helsingin yliopisto - Palveluntarjoajarekisteri

source: Metadata
fi: Metatiedot

source: Displaying validated metadata. This is used for production IdP.
fi: Näytetään hyväksytyt metatiedot. Näitä käytetään tuotanto-IdP:lla.

source: Show unvalidated
fi: Näytä hyväksymätön

source: Displaying unvalidated metadata. This is used for test IdP.
fi: Näytetää hyväksymättömät metatiedot. Näitä käytetään testi-IdP:llä.

source: Show validated
fi: Näytä hyväksytty

source: Could not find metadata
fi: Metadataa ei löytynyt

source: Metadata import
fi: Metadatan tuonti

source: Service provider imported with following notifications
fi: Palvelu tuotu seuraavin huomioin

source: Service provider imported succesfully
fi: Palvelu tuotu onnistuneesti

source: Continue to summary view
fi: Jatka yhteenvetoon

source: Import
fi: Tuo

source: Metadata management
fi: Metatietojen hallinta

source: You may commit changes to metadata here.
fi: Voit viedä tehdyt muutokset metatietoihin täällä.

source: Using production SPs with validated data.
fi: Käytetään tuotanto-SP:tä hyväksytyillä metatiedoilla.

source: Previous commits
fi: Edelliset muutokset

source: Time
fi: Aika

source: Commit changes
fi: Muutokset

source: Export
fi: Vie

source: Changes to previous commit
fi: Muutokset edelliseen versioon

source: There are no uncommitted changes.
fi: Muutoksia ei ole tehty.

source: The accepted redirect URIs for the service.
fi: Sallitut paluuosoitteet palvelulle.

source: List of redirect URIs
fi: Lista paluuosoitteista

source: Do you want to remove selected redirect URIs?
fi: Haluatko poistaa valitut paluuosoitteet?

source: No redirect URIs
fi: Ei paluuosoitteita

source: Add redirect URI
fi: Lisää paluuosoite

source: Basic information
fi: Perustiedot

source: Basic information for your service provider. Necessary information for production use are marked.
fi: Perustiedot palvelusta. Tuotantoon vaaditut tiedot on erikseen merkitty.

source: Service provider removal
fi: Poista palvelu

source: Please confirm the removal of this service provider:
fi: Vahvista tämän palvelun poisto:

source: Details
fi: Kooste

source: Colors legend
fi: Värien merkitykset

source: Modified since last validation
fi: Muutettu edellisen hyväksynnän jälkeen

source: Removed since last validation
fi: Poistettu edellisen hyväksynnän jälkeen

source: This service requires manual configuration. Detailed information should be in the admin notes.
fi: Tämä palvelu vaatii paikallisia konfiguraatiomuutoksia. Tarkempien tietojen pitäisi löytyä ylläpitäjän muistiinpanoista.

source: This service provider is currently not published to the production or the test IdPs. You may publish this SP in the Technical Attributes page.
fi: Tätä palvelua ei ole tällä hetkellä julkaistu tuotanto- tai testi-IdP:lle. Voit julkaista palvelun Tekniset tiedot -sivulla.

source: You may also remove this SP from the registry by using the link at the bottom of this page.
fi: Voit poistaa tämän palvelun rekisteristä sivun alareunassa olevalla linkillä.

source: Missing data
fi: Puuttuvat tiedot

source: This service is marked for the production use but is missing following data:
fi: Tämä palvelu on merkitty tuotantoon, mutta siitä puuttuu seuraavat tiedot:

source: Waiting for validation
fi: Odottaa hyväksymistä

source: There are changes waiting for validation by the IdP administrators.
fi: Palveluun on tehty muutoksia, jotka odottavat rekisterin ylläpitäjien hyväksymistä.

source: You will receive an email when the changes are validated.
fi: Saat sähköpostin, kun muutokset on hyväksytty.

source: NB. only production systems are validated. Test servers are updated automatically every 15 minutes, using unvalidated data.
fi: Huom. vain tuotantojärjestelmien muutokset hyväksytään. Testipalveluiden tiedot päivitetään testi-IdP:lle automaattisesti 15 minuutin välein käyttäen hyväksymättömiä tietoja.

source: Validate changes
fi: Hyväksy muutokset

source: This object has changed. Click the button to validate all changes listed in this page.
fi: Tämän palvelun tietoja on muutettu. Tarkasta ne uudelleen ennen hyväksymistä.

source: Validated value
fi: Hyväksytty arvo

source: Technical attributes
fi: Tekniset tiedot

source: OIDC redirect URIs
fi: OIDC paluuosoitteet

source: Registry administrators
fi: Palvelun ylläpitäjät

source: Name
fi: Nimi

source: Email
fi: Sähköposti

source: Attribute requisitions
fi: Attribuuttien luovutuspyynnöt

source: Userinfo
fi: Käyttäjätiedot

source: SAML endpoints
fi: SAML-yhteysosoitteet

source: LDAP user groups
fi: LDAP-käyttäjäryhmät

source: name
fi: nimi

source: Removing this service provider
fi: Poista tämä palvelu

source: Click this link to remove this service provider
fi: Klikkaa linkkiä poistaaksesi tämän palvelun

source: Adding a new LDAP connection
fi: Lisää uusi LDAP-palvelu

source: This form is used to add new LDAP connection request.
fi: Tätä lomaketta käytetään uuden LDAP-palvelun lisäämiseen.

source: More information about registering services can be found from the external site
fi: Lisää tietoja palvelun rekisteröinnistä saat ulkoiselta sivustolta

source: instructions_url_ldap
fi: https://wiki.helsinki.fi/pages/viewpage.action?pageId=197657102

source: Required attributes for the production use. Some of the attributes are defined later in different forms.
fi: Vaaditut tiedot tuotantokäyttöön. Osa tiedoista määritetään myöhemmin muilla lomakkeilla.

source: Service name in English or in Finnish
fi: Palvelun nimi suomeksi tai englanniksi.

source: Service description in English or in Finnish
fi: Palvelun kuvaus suomeksi tai englanniksi.
