Repository: UniversityofHelsinki/sp-registry
Catalog: rr/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Name:
fi: Nimi:

source: schema
fi: skeema

source: Not a public SAML attribute, might not be available for SAML services.
fi: Ei julkinen SAML-attribuutti, eikä ole välttämättä saatavilla SAML-palveluille.

source: Not a public LDAP attribute, might not be available from LDAP.
fi: Ei julkinen LDAP-attribuutti, eikä välttämättä saatavilla LDAPista.

source: Not a public OIDC attribute.
fi: Ei julkinen OIDC-attribuutti.

source: Release from the userinfo endpoint
fi: Julkaise userinfo-kyselyssä

source: Release in the ID Token
fi: Julkaise ID-tokenissa

source: Certificate in PEM format, WITHOUT -----BEGIN CERTIFICATE----- and -----END CERTIFICATE-----
fi: Varmenne PEM-muodossa ilman kohtia -----BEGIN CERTIFICATE----- ja -----END CERTIFICATE-----.

source: Use this certificate for signing. If both signing and encryption are left empty, certificate is used for both.
fi: Allekirjoitukseen käytettävä varmenne. Jos sekä allekirjoitus- että salaus-kohdat jätetään tyhjäksi, varmennetta käytetään molempiin.

source: Use this certificate for encryption
fi: Salaukseen käytettävä varmenne

source: Contact already exists
fi: Yhteystieto on jo lisätty

source: Select production SPs.
fi: Valitse tuotantopalvelut

source: Select test SPs
fi: Valitse testipalvelut

source: Select individual SPs
fi: Valitse yksittäisiä palveluita

source: Select admin emails
fi: Valitse ylläpitäjien sähköpostit

source: Select technical contacts
fi: Valitse tekniset kontaktit

source: Select support contacts
fi: Valitse tukikontaktit

source: Select administrative contacts
fi: Valitse hallinnolliset kontaktit

source: Select template if you want to send email
fi: Valitse viestipohja, jos haluat lähettää sähköpostia

source: Almost never used, leave empty if you do not know for sure.
fi: Ei käytetä juuri koskaan, jätä tyhjäksi jos et tiedä varmasti.

source: Usually not used and is safe to leave empty.
fi: Yleensä ei käytetä ja on turvallista jättää tyhjäksi.

source: Service Provider metadata
fi: Palvelun metatiedot

source: Disable checks for Endpoint bindings
fi: Poista tarkastukset yhteysosoitteille

source: Validate imported metadata
fi: Hyväksy tuodut metatiedot

source: Not valid XML:
fi: Virheellinen XML:

source: First element should be EntityDescriptor
fi: Ensimmäisen elementin tulee olla EntityDescriptor

source: Could not find entityID
fi: entityID puuttuu

source: Entity Id should be URI, please contact IdP admins if this is not possible.
fi: Entity ID:n tulee olla URI, ota yhteyttä IdP-ylläpitäjiin, jos tämä ei ole mahdollista

source: Entity Id already exists
fi: Entity ID on jo olemassa

source: Commit message
fi: Muutoksen viesti

source: Organization who is responsible for the data given to the service.
fi: Organisaatio, joka vastaa palveluun välitetystä tiedosta.

source: Short (max 70 characters) and descriptive name for the service in Finnish.<div class="text-danger">Required for both production and test use.</div>
fi: Lyhyt (korkeintaan 70 merkkiä) ja kuvaava nimi palvelulle suomeksi.<div class="text-danger">Vaadittu tuotanto- ja testikäyttöön.</div>

source: Short (max 70 characters) and descriptive name for the service in English.<div class="text-danger">Required for both production and test use.</div>
fi: Lyhyt (korkeintaan 70 merkkiä) ja kuvaava nimi palvelulle englanniksi.<div class="text-danger">Vaadittu tuotanto- ja testikäyttöön.</div>

source: Short (max 70 characters) and descriptive name for the service in Swedish.
fi: Lyhyt (korkeintaan 70 merkkiä) ja kuvaava nimi palvelulle ruotsiksi.

source: Short (max 140 characters) description of the service in Finnish. <div class="text-danger">Required for both production and test use.</div>
fi: Lyhyt (korkeintaan 140 merkkiä) kuvaus palvelulle suomeksi.<div class="text-danger">Vaadittu tuotanto- ja testikäyttöön.</div>

source: Short (max 140 characters) description of the service in English. <div class="text-danger">Required for both production and test use.</div>
fi: Lyhyt (korkeintaan 140 merkkiä) kuvaus palvelulle englanniksi.<div class="text-danger">Vaadittu tuotanto- ja testikäyttöön.</div>

source: Short (max 140 characters) description of the service in Swedish.
fi: Lyhyt (korkeintaan 140 merkkiä) kuvaus palvelulle ruotsiksi.

source: Get privacy policy URLs from the organization if such are set. <div class="text-danger">This or privacy policy URLs below are required for production use, if service requests any user information.</div>
fi: Linkki englanninkieliseen tietosuojaselosteeseen. Linkin täytyy olla julkinen. <div class="text-danger">Tämä tai erilliset osoitteet vaaditaan tuotantokäyttöönVaadittu tuotantokäyttöön, jos palvelu pyytää henkilötietoja.</div>

source: Link to privacy policy in Finnish. Link must be publicly accessible.
fi: Linkki englanninkieliseen tietosuojaselosteeseen. Linkin täytyy olla julkinen.

source: Link to privacy policy in English. Link must be publicly accessible.
fi: Linkki englanninkieliseen tietosuojaselosteeseen. Linkin täytyy olla julkinen.

source: Link to privacy policy in Swedish. Link must be publicly accessible.
fi: Linkki ruotsinkieliseen tietosuojaselosteeseen. Linkin täytyy olla julkinen.

source: Used for debugging and testing services.
fi: Käytetään palveluiden testaamiseen.

source: Link to external application portfolio.
fi: Linkki palvelun tietoihin sovellussalkussa.

source: Additional notes about this service.
fi: Lisätietoja palvelusta.

source: Additional administrative notes. Writable only by registry admins but showed in summary to SP admins.
fi: Ylläpitoon liittyviä huomioita. Muokattavissa vain rekisterin ylläpitäjien toimesta, mutta näytetään myös palvelun ylläpitäjille.

source: Name in English or in Finnish is required.
fi: Palvelun nimi suomeksi tai englanniksi vaaditaan.

source: Select organization to use privacy policy URLs from organization.
fi: Valitse organisaatio käyttääksesi organisaation tietosuojaselosteita.

source: Selected organization does not have privacy policy URLs defined. You cannot user privacy policy URLs from organization.
fi: Valitulla organisaatiolla ei ole tietosuojaselosteita määritettynä, joten et voi käyttää organisaation tietosuojaselosteita.

source: Should be URI including scheme, hostname of your application and path e.g. https://test.helsinki.fi/sp. <div class="text-danger">Required for both production and test use.</div>
fi: Muotona URI sisältäen protokollan, osoitteen ja polun, esim. https://test.helsinki.fi/sp. <div class="text-danger">Vaaditaan sekä tuotanto- että testikäyttöön.</div>

source: For service providers supporting discovery service. Usually only valid if you are accepting logins for multiple IdPs.
fi: Jos palvelu tukee erillistä valintapalvelua eri kirjautumispalveluihin. Yleensä näin on vain, jos palvelusi sallii kirjautumisia useilta eri identiteetintarjoajilta.

source: Support for name identifier formats. Check <a href="https://wiki.shibboleth.net/confluence/display/CONCEPT/NameIdentifiers" target="_blank">Shibboleth wiki</a> for more information.
fi: Tuetut name identifier -muodot. Katso lisätietoja <a href="https://wiki.shibboleth.net/confluence/display/CONCEPT/NameIdentifiers" target="_blank">Shibboleth-wikistä</a>.

source: IdP sings attribute assertions sent to SP. Defaults to False because assertions are encrypted by default.
fi: IdP allekirjoittaa palvelulle lähetetyt attribuuttitiedot. Oletuksena Ei, koska vahvistukset salataan oletuksena.

source: IdP requires signed authentication requests from this SP.
fi: IdP vaatii allekirjoitettuja autentikointipyyntöjä palvelulta.

source: IdP signs responses sent to SP. Defaults to True and should not be changed.
fi: IdP allekirjoittaa palvelulle lähetetyt vastaukset. Oletuksena Kyllä, eikä tätä pitäisi muuttaa.

source: IdP encrypts attribute assertions sent to SP. Defaults to True. Do not change unless you are using a SP that does not support encryption.
fi: IdP salaa palvelulle lähetettävät attribuuttitiedot. Oletuksena kyllä. Muuta vain tilanteessa, jossa käyttämäsi SAML-toteutus ei tue salausta. Tällöin attribuuttitietojen allekirjoitus on asetettava päälle.

source: MFA authentication is required for all users. If set here, service must not require specific authentication context class as it will trigger an error.
fi: Vahvempi tunnistautuminen vaaditaan kaikilta käyttäjiltä. Jos asetus on päällä, ei palvelu saa vaatia tiettyä autentikointitapaa tai kirjautuminen päättyy virheeseen.

source: Forces using of SHA-1 algorithm in signatures. Default is SHA-256. Should not be used unless using old SAML software which does not support SHA-256.
fi: IdP käyttää SHA-1-algoritmia allekirjoituksissa. Oletus on SHA-256. Asetusta tulee käyttää vain, jos palvelun vanha SAML-sovellus ei tue muuta.

source: This service provider requires the specific NameIdFormat. If set, only one NameIdFormat must be chosen in the list above. Do not set if you do not know what this means, as this is almost newer required.
fi: Tämä palvelu vaatii tietyn NameIdFormat-arvon. Jos tämä on päällä, vain yksi NameIdFormat-arvo valitaan yllä olevasta listasta. Älä käytä, jos et tiedä tarkasti mitä teet, koska tätä ei juuri koskaan vaadita, vaan tunnistus hoidetaan attribuuteilla.

source: This service provider requires manual configuration. Set by registry admins if necessary.
fi: Tämä palvelu vaatii käsin tehtyjä muutoksia IdP:lle. Asetetaan ylläpitäjien toimesta, jos tarpeen.

source: Publish this SP to the production IdP. Only validated data is used. Any changes to production SPs must be validated by the IdP administrators before coming into effect.<div class="text-danger">Required for production use.</div>
fi: Julkaise tämä palvelu tuotanto-IdP:lle. Vain hyväksyttyjä tietoja käytetään. Kaikki muutokset tuotantopalveluihin täytyy hyväksyä IdP-ylläpitäjien toimesta ennen niiden voimaantuloa. <div class="text-danger">Vaadittu tuotantokäyttöön.</div>

source: Publish this SP to the test IdP using unvalidated data. Any changes might take up to 10 minutes until they are published to the test IdP.
fi: Julkaise tämä palvelu testi-IdP:lle käyttäen hyväksymättömiä tietoja. Muutokset päivitetään testi-IdP:lle 10 minuutin sisällä.

source: For administrative use e.g. for testing different SPs during IdP updates.
fi: Käytetään testaamaan eri ohjelmistoja ajavia palveluita IdP-päivitysten yhteydessä.

source: Does this SP automatically update IdP metadata at least once a day?
fi: Päivittääkö tämä palvelu IdP:n metatiedot automaattisesti vähintään kerran päivässä?

source: Following parameters are missing for production use:
fi: Seuraavat tuotantokäytössä vaaditut määritykset puuttuvat:

source: Does this service use the LDAPAuth proxy in order to access user and group data for authentication and access control?
fi: Käyttääkö tämä palvelu käyttäjä- ja ryhmätietoja LDAPAuthin kautta autentikointia ja pääsynhallintaa varten?

source: Full server names (not IPs), separated by space. User for access control.
fi: Täydet palvelinten nimet (DNS-nimi, ei IP), erotettuna välilyönnillä. Käytetään pääsynvalvontaan.

source: What is the target group (users) of this service?
fi: Mikä on tämän palvelun kohderyhmä (käyttäjät)?

source: Separate service account is used for LDAP queries (recommended way).
fi: LDAP-kyselyihin käytetään erillistä palvelutunnusta (suositeltu tapa).

source: Email and phone number for delivering service account credentials. Use a firstname.lastname@helsinki.fi address and the same person's mobile phone in non-international format, that is, start it with 0. Separete the email and phone number by space.
fi: Sähköposti ja puhelinnumero, joihin palvelutunnuksen tiedot toimitetaan. Käytä etu.suku@helsinki.fi-osoitetta ja saman henkilön matkapuhelinnumeroa ei-kansainvälisessä muodossa, eli 0-alkuisena. Erota sähköpostiosoite ja puhelinnumero toisistaan välilyönnillä.

source: Service requires access to all LDAP groups.
fi: Palvelu tarvitsee pääsyn kaikkiin LDAP-ryhmiin.

source: Service stores all users and released attributes locally. If you only save user data when user logs in, do not check this.
fi: Palvelu tallentaa kaikki käyttäjätiedot ja luovutetut attribuutit paikallisesti. Jos tallennat tietoja vain kun käyttäjä kirjautuu sisään, älä valitse tätä.

source: Service stores user passwords locally.
fi: Palvelu tallentaa käyttäjien salasanat paikallisesti.

source: Why is this service storing user passwords locally and how? This is not generally a good idea.
fi: Miksi tämä palvelu tallentaa käyttäjien salasanoja ja kuinka? Tämä ei yleisesti ottaen ole hyvä tapa.

source: Service stores requested groups and their member lists locally.
fi: Palvelu tallentaa pyydetyt ryhmät ja niiden jäsentiedot paikallisesti.

source: Publish this service to LDAP production servers.
fi: Julkaise tämä palvelu LDAP-tuotantopalvelimille.

source: Invalid service account contact.
fi: Virheellinen yhteysosoite palvelutunnukselle

source: Reset client secret
fi: Luo uusi palvelun salaisuus

source: Remove client secret
fi: Poista palvelun salaisuus

source: Client identifier of the relying party. It is usually recommended to use random identifier. <div class="text-danger">Required for both production and test use.</div>
fi: Palvelun tunniste (client identifier). On suositeltavaa käyttää sattunnaista tunnisteen arvoa. <div class="text-danger">Vaaditaan sekä tuotanto- että testikäyttöön.</div>

source: Grant types allowed for this RP (grant_types metadata value).
fi: Grant-tyypit, jotka ovat sallittuja palvelulle (metadata-arvo grant_types)

source: Response types allowed for this RP (response_types metadata value).
fi: Vastaustyypit, jotka ovat sallittuja palvelulle (metadata-arvo response_types)

source: OIDC scopes used. "openid" scope is automatically added. You may also require user attributes as claims from the Attributes section.
fi: Halutut OIDC scopes -arvot. "openid" scope lisätään automaattisesti. Voit myös pyytää käyttäjäattribuutteja claim-arvoina Attribuutit-osiossa.

source: Application type. Used for validating redirect_uris.
fi: Sovelluksen tyyppi. Käytetään redirect_uri-arvojen tarkistuksiin.

source: Request a specific subject identifier.
fi: Pyydä tietty käyttäjän tunniste (subject identifier).

source: If empty, uses client_secret_basic by default.
fi: Jos tyhjä, käytetään oletuksena client_secret_basic.

source: URI for RPs JSON Web Key document (jwks_uri).
fi: URL-osoite palvelun JSON Web Key -dokumenttiin (jwks_uri)

source: RPs JSON Web Key document (jwks) passed as a parameter. Should only be used if the use of jwks_uri is not possible.
fi: Palvelun JSON Web Key -dokumentti (jwks) arvona. jwks_uri-osoitetta tulisi käyttää tämän sijaan, jos vain mahdollista.

source: Publish this RP to the production OP. Only validated data is used. Any changes to production RPs must be validated by the IdP administrators before coming into effect.<div class="text-danger">Required for production use.</div>
fi: Julkaise tämä palvelu tuotanto-IdP:lle. Vain hyväksyttyjä tietoja käytetään. Kaikki muutokset tuotantopalveluihin täytyy hyväksyä IdP-ylläpitäjien toimesta ennen niiden voimaantuloa. <div class="text-danger">Vaadittu tuotantokäyttöön.</div>

source: Publish this RP to the test IdP using unvalidated data. Any changes might take up to 10 minutes until they are published to the test IdP.
fi: Julkaise tämä palvelu testi-IdP:lle käyttäen hyväksymättömiä tietoja. Muutokset päivitetään testi-IdP:lle 10 minuutin sisällä.

source: OIDC product used by this client. For administrative use e.g. for testing different RPs during IdP updates.
fi: Käytetty OIDC-sovellus. Käytetään testaamaan eri ohjelmistoja ajavia palveluita IdP-päivitysten yhteydessä.

source: Does this RP automatically update IdP metadata at least once a day?
fi: Päivittääkö tämä palvelu IdP:n metatiedot automaattisesti vähintään kerran päivässä?

source: Resets the client secret.
fi: Luo uusi palvelun salaisuus

source: Removes the client secret. Secret is not used if jwks are provided for client identification or application type is native.
fi: Poistaa jaetun salaisuuden. Jaettua salaisuutta ei käytetä julkisen avaimen menetelmää käytettäessä tai jos sovellusken tyyppi on 'native'.

source: Client ID already exists.
fi: Sovelluksen tunniste on jo olemassa.

source: Not a valid JSON.
fi: JSONin muoto on virheellinen.

source: Invalid JSON keys.
fi: Väärät JSON-avaimet

source: No keys found.
fi: Avaimia ei löydetty

source: JWK missing key ID.
fi: JWK:sta puuttuu key ID

source: Invalid JWK.
fi: Virheellinen JWK

source: Both remove and reset client secret selected.
fi: Et voi valita sekä salaisuuden poistoa että uuden luontia.

source: Both jwks and jwks_uri selected. Use only jwks_uri if it is supported.
fi: Sekä jwks että jwks_uri on valittuna. Käytä vain jwks_uri:a, jos palvelu tukee sitä.

source: authorization_code grant type must be set for code response type.
fi: authorization_code grant type täytyy valita, jos response type on code.

source: implicit grant type must be set for token response type.
fi: implicit grant type täytyy valita, jos response type on token.

source: implicit grant type must be set for id_token response type.
fi: implicit grant type täytyy valita, jos response type on id_token.

source: Link to privacy policy in Finnish. Link must be publicly accessible. <div class="text-danger">Required for production use if the service requests any personal information.</div>
fi: Linkki suomenkieliseen tietosuojaselosteeseen. Linkin täytyy olla julkinen. <div class="text-danger">Vaadittu tuotantokäytötön, jos palvelu vaatii henkilötietoja.</div>

source: Link to privacy policy in English. Link must be publicly accessible. <div class="text-danger">Required for production use if the service requests any personal information.</div>
fi: Linkki englanninkieliseen tietosuojaselosteeseen. Linkin täytyy olla julkinen. <div class="text-danger">Vaadittu tuotantokäyttöön, jos palvelu vaatii henkilötietoja.</div>

source: Full server names (not IPs), one per line. Used for access control. <div class="text-danger">Required for non-ldapauth.</div>
fi: Täydet palvelinten nimet (DNS-nimi, ei IP), yksi per rivi. Käytetään pääsynvalvontaan. <div class="text-danger">Vaadittu.</div>

source: Short (max 70 characters) and descriptive name for the service in Finnish. <div class="text-danger">Required. </div>
fi: Lyhyt (korkeintaan 70 merkkiä) ja kuvaava nimi palvelulle suomeksi.<div class="text-danger">Vaadittu tieto.</div>

source: Short (max 70 characters) and descriptive name for the service in English.
fi: Lyhyt (korkeintaan 70 merkkiä) ja kuvaava nimi palvelulle englanniksi.

source: Short (max 140 characters) description of the service in Finnish. <div class="text-danger">Required.</div>
fi: Lyhyt (korkeintaan 140 merkkiä) kuvaus palvelulle suomeksi.<div class="text-danger">Vaadittu tieto.</div>

source: Short (max 140 characters) description of the service in English.
fi: Lyhyt (korkeintaan 140 merkkiä) kuvaus palvelulle englanniksi.

source: Link to privacy policy in Finnish. Link must be publicly accessible. <div class="text-danger">Required if the service requests any personal information.</div>
fi: Linkki suomenkieliseen tietosuojaselosteeseen. Linkin täytyy olla julkinen. <div class="text-danger">Vaadittu, jos palvelu vaatii mitään henkilötietoja.</div>

source: Invalid list of server names.
fi: Virheellinen palvelimen nimi.

source: Invalid Finnish name.
fi: Virheellinen suomenkielinen nimi.

source: Client ID already exists
fi: Sovelluksen tunniste on jo olemassa

source: Confirm closing
fi: Vahvista sulkeminen

source: Do not send validation email to SP admins.
fi: Älä lähetä ilmoitusta tietojen hyväksymisestä palvelun ylläpitäjille.

source: Email where invitation is sent
fi: Sähköpostiosoite, johon kutsu lähetetään

source: Using default template if none given.
fi: Käytetään kutsun oletuspohjaa, jos muuta ei valita.

source: Group name
fi: Ryhmän nimi

source: 6-32 characters, allowed characters are [a-z0-9-]. May not start or end with "-".
fi: 6-32 merkkiä, sallitut merkit ovat [a-z0-9-]. Ei voi alkaa tai loppua "-"-merkkiin

source: Minimum length 6 characters.
fi: Vähintään 6 merkkiä.

source: Maximum length 32 characters.
fi: Enintään 32 merkkiä.

source: Invalid characters in group name.
fi: Virheellisiä merkkejä ryhmän nimessä.

source: Generate attribute data for name and username based fields.
fi: Täytä nimi- ja käyttäjänimipohjaiset attribuutit auttomaattisesti.

source: Generate random attribute data for other fields.
fi: Luo satunnaiset arvot muille kentille.

source: Scope
fi: Pääte

source: Scope for scoped attributes. Default is 'example.org'.
fi: Päätteellisten attribuuttien pääte. Oletuksena käytetään 'example.org'.

source: Number of users
fi: Käyttäjien määrä

source: Create X users. Username and password will be appended with <number>
fi: Luo X käyttäjää. Järjestysnumero lisätään käyttäjätunnuksen ja salasanan loppuun.

source: Scope must be a valid hostname
fi: Scopen täytyy olla mahdollinen hostname

source: Number of users must be integer
fi: Käyttäjien määrän täytyy olla kokonaisluku

source: Username already exists
fi: Käyttäjänimi on jo olemassa

source: Value must be scoped
fi: Arvon täytyy olla päätteellinen

source: Group already added
fi: Ryhmä on jo lisätty

source: Attribute FriendlyName
fi: Attribuutti FriendlyName

source: Attribute information
fi: Tietoja

source: Attribute OID
fi: Attribuutin OID

source: Attribute ID
fi: Attribuutin ID

source: Attribute NameFormat
fi: Attribuutin NameFormat

source: Show in SAML attribute list
fi: Näytä SAML-palveluille

source: Show link to funetEduPerson-schema
fi: Näytä linkki funetEduPerson-skeemaan

source: Show in LDAP attribute list
fi: Näytä LDAP-palveluille

source: Show in OIDC attribute list
fi: Näytä OIDC-palveluille

source: Attribute Group for LDAP
fi: LDAPin attribuuttiryhmä

source: Attribute claim name for OIDC
fi: Attribuutti-claimin nimi OIDC:lle

source: Show in Attribute test service
fi: Näytä attribuuttien testipalvelussa

source: Required attribute in test service
fi: Vaadittu arvo testipalvelussa

source: Scoped attribute
fi: Päätteellinen attribuutti

source: Regex text for attribute validation
fi: Regex attribuutin arvon tarkistamiseen

source: Shibboelth environmental variable for the attribute
fi: Shibboleth-ympäristömuuttuja attribuutille

source: Created at
fi: Luotu

source: Updated at
fi: Päivitetty

source: Unable to load certificate
fi: Ei voitu ladata varmennetta

source: Certificate already exists
fi: Varmenne on jo lisätty

source: Issuer cn
fi: Myöntäjän cn

source: Valid from
fi: Voimassaolo alkaa

source: Valid until
fi: Voimassaolo päättyy

source: Key size
fi: Avaimen koko

source: Certificate
fi: Varmenne

source: Use for signing
fi: Käytetään allekirjoitukseen

source: Use for encryption
fi: Käytetään salaukseen

source: Entry end time
fi: Päättymispäivä

source: Validated on
fi: Hyväksytty

source: removed
fi: poistettu

source: pending removal
fi: odottaa poistoa

source: pending validation
fi: odottaa vahvistusta

source: update pending validation
fi: muutos odottaa vahvistusta

source: validated
fi: vahvistettu

source: Administrative
fi: Hallinnollinen

source: Technical
fi: Tekninen

source: Support
fi: Tuki

source: Contact Type
fi: Yhteystietotyyppi

source: First Name
fi: Etunimi

source: Last Name
fi: Sukunimi

source: E-Mail
fi: Sähköpostiosoite

source: Message title
fi: Viestin otsikko

source: Message body
fi: Viestin sisältö

source: Endpoint already exists
fi: Yhteysosoite on jo lisätty

source: Index already exists
fi: Yhteysosoite annetulla järjestysnumerolla on jo olemassa

source: Default endpoint must be indexed
fi: Oletusyhteysosoitteella on oltava järjestysnumero

source: Default endpoint already exists
fi: Oletusyhteysosoite on jo olemassa
