Repository: UniversityofHelsinki/sp-registry
Catalog: rr/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Privacy policy URL in English or in Finnish
fi: Tietosuojaselosteen osoite suomeksi tai englanniksi.

source: Server Names (for non- LDAPAuth users)
fi: Palvelimien nimet (jos palvelu ei käytä LDAPAuthia)

source: Technical and support contacts
fi: Tekniset yhteystieto

source: Technical information
fi: Tekniset tiedot

source: Techical attributes for your service provider.
fi: Palvelun tekniset tiedot.

source: This list includes all service providers you currently have administration access.
fi: Tämä sivu listaa kaikki palvelut, joihin teillä on hallintaoikeus.

source: SAML Providers
fi: SAML-palvelut

source: Add a new SAML service provider
fi: Lisää uusi SAML-palvelu

source: Show all SAML providers
fi: Näytä kaikki SAML-palvelut

source: Publish to production IdP (validated status)
fi: Tuotantoon julkaistu (hyväksytty tieto)

source: Publish to test IdP
fi: Testiin julkaistu

source: OK / Modified, modified are waiting for validation. Yellow means change in production, blue change in test service.
fi: OK / Muutettu, muutetut odottavat hyväksyntää. Keltainen merkitsee muutosta tuotannossa, sininen testipalvelussa.

source: Number of admins (invites)
fi: Ylläpitäjien määrä (kutsuja)

source: Modified
fi: Muutettu

source: You do not have access to any service providers.
fi: Teillä ei ole oikeuksia yhteenkään palveluun.

source: OIDC Providers
fi: OIDC-palvelut

source: Add a new OIDC relying party
fi: Lisää uusi OIDC-palvelu

source: Show all OIDC providers
fi: Näytä kaikki OIDC-palvelut

source: LDAP Providers
fi: LDAP-palvelut

source: Add a new LDAP connection
fi: Lisää uusi LDAP-palvelu

source: Show all LDAP providers
fi: Näytä kaikki LDAP-palvelut

source: Publish to production
fi: Julkaise tuotantoon

source: OK / Modified, modified are waiting for validation
fi: OK / Muutettu, muutetut odottavat hyväksyntää

source: Adding a new OIDC relying party
fi: Lisää uusi OIDC-palvelu

source: This form is used to add a new OIDC service to the University of Helsinki's single sign on system.
fi: Tätä lomaketta käytetään uusien OIDC-palveluiden lisäämiseen Helsingin yliopiston kertakirjautumisjärjestelmään.

source: More information about configuring and registering service providers can be found from the external site
fi: Lisää tietoja palvelun rekisteröinnistä ja määrityksistä löytyy ulkoiselta sivustolta

source: instructions_url_oidc
fi: https://wiki.helsinki.fi/display/IAMasioita/Ohjeet+Shibbolointiin

source: Required attributes for the production RPs.
fi: Vaaditut tiedot tuotantokäyttöön.

source: Client Id
fi: Palvelun tunniste

source: Techical attributes for your service provider. Necessary information for the production use are marked.
fi: Palvelun tekniset tiedot. Tuotantoon pakolliset tiedot on merkitty erikseen.

source: <a target="_blank" rel="noopener noreferrer" href="https://openid.net/specs/openid-connect-registration-1_0.html#ClientMetadata">More information about client metadata values</a>
fi: <a target="_blank" rel="noopener noreferrer" href="https://openid.net/specs/openid-connect-registration-1_0.html#ClientMetadata">Lisätietoja palvelun metadata-arvoista</a>

source: Show client secret
fi: Näytä palvelun salaisuus

source: Special configurations
fi: Erityisasetukset

source: Signing and encryption
fi: Allekirjoitus ja salaus

source: NameId settings
fi: NameId asetukset

source: MFA and authorization
fi: MFA ja pääsynhallinta

source: SAML Product
fi: SAML-palvelu

source: Service Provider Signing and Encryption
fi: Palveluiden allekirjoitus ja salaus

source: This list includes all service providers which do not have default signing and encryption attributes.
fi: Tämä lista sisältää palvelut, joilla ei ole oletusasetukset salaus- ja allekirjoituskäytännöissä.

source: SHA1 algorithm
fi: SHA-1-algoritmi

source: Sign assertions
fi: Allekirjoita vahvistukset (assertions)

source: Sign responses
fi: Allekirjoita vastaukset

source: Encrypt assertions
fi: Salaa vahvistukset (assertions)

source: NameId Format settings
fi: NameId-asetukset

source: This list includes all service providers which have specific NameIdFormat settings.
fi: Tämä lista sisältää palvelut, joilla on tietty NameIdFormat-asetus.

source: Force NameId
fi: Pakotettu NameId

source: NameIds
fi: NameId

source: MFA and authorization settings
fi: MFA ja pääsynhallinta-asetukset

source: This list includes all service providers which have MFA forced from server side.
fi: Lista sisältää palvelut, joissa on palvelimelta pakotettu vahvennettu tunnistus.

source: Force MFA
fi: Pakotettu MFA

source: This list shows which SAML product services are using.
fi: Listaa palveluiden käyttämät SAML-tuotteet

source: Autoupdate metadata
fi: Automaattinen metadatan päivitys

source: Adding a new service provider
fi: Lisää uusi palvelu

source: This form is used to add a new service to the University of Helsinki's single sign on system.
fi: Tätä lomaketta käytetään uusien palveluiden lisäämiseen Helsingin yliopiston kertakirjautumisjärjestelmään.

source: instructions_url_saml
fi: https://wiki.helsinki.fi/display/IAMasioita/Ohjeet+Shibbolointiin

source: Required attributes for the production SPs.
fi: Vaaditut tiedot tuotantokäyttöön.

source: Some of the attributes are defined later in different forms.
fi: Osa tiedoista määritetään myöhemmin muilla lomakkeilla.

source: AssertionConsumerService endpoint
fi: AssertionConsumerService-yhteysosoite

source: Add by importing service provider metadata
fi: Lisää uusi palvelu tuomalla metatieto-XML

source: Users who can manage this service provider. You can send invites through email.
fi: Ylläpitäjät, joilla on oikeus hallinnoida tätä palvelua. Voit lähettää kutsuja sähköpostitse.

source: Users without a University of Helsinki login account have to requisition a local account from IdP administrators.
fi: Käyttäjien, joilla ei ole Helsingin yliopiston käyttäjätunnusta, täytyy pyytää paikallinen käyttäjätunnus rekisterin ylläpitäjiltä.

source: Admin groups are IAM groups. If the group has not been used in the SP-registry before, users will only get it when they log in next time.
fi: Ylläpitoryhmät ovat IAM-ryhmiä. Jos ryhmä ei ole aikaisemmin ollut käytössä SP-rekisterissä, lisätään käyttäjät ryhmään vasta heidän seuraavan kerran kirjautuessa.

source: List of admins
fi: Lista ylläpitäjistä

source: Do you want to remove selected admins?
fi: Haluatko poistaa valitut ylläpitäjät?

source: No admins
fi: Ei ylläpitäjiä

source: List of invites
fi: Lista kutsuista

source: Do you want to remove selected invites?
fi: Haluatko poistaa valitut kutsut?

source: No invites
fi: Ei kutsuja

source: Add admin
fi: Lisää ylläpitäjä

source: Example message
fi: Esimerkkiviesti

source: Body
fi: Viesti

source: Send invitation
fi: Lähetä kutsu

source: Show message
fi: Näytä viesti

source: List of admin groups
fi: Lista ylläpitoryhmistä

source: Group
fi: Ryhmän

source: Do you want to remove selected admin groups?
fi: Haluatko poistaa valitut ylläpitoryhmät?

source: No admin groups
fi: Ei ylläpitoryhmiä

source: Add admin group
fi: Lisää ylläpitoryhmä

source: Add group
fi: Lisää ryhmä

source: Week
fi: Viikko

source: Month
fi: Kuukausi

source: Year
fi: Vuosi

source: All
fi: Kaikki

source: Show table
fi: Näytä taulukko

source: Date
fi: Päivä

source: Unique users
fi: Yksilölliset käyttäjät

source: No statistics
fi: Ei tilastoja

source: Login Statistics Summary
fi: Kirjautumistilastot

source: Service
fi: Palvelu

source: 6 months
fi: 6 kuukautta

source: These users are added to the test IdP database and can be used to test this SP against the test IdP.
fi: Nämä käyttäjät lisätään testi-IdP:n tietokantaan ja niitä voidaan käyttää testaamaan palveluun kirjautumista.

source: List of users
fi: Lista käyttäjistä

source: Click the username to configure user attribute values.
fi: Klikkaa käyttäjänimeä määrittääksesi attribuuttitiedot.

source: Username
fi: Käyttäjänimi

source: Do you want to remove selected test users?
fi: Haluatko poistaa valitut testikäyttäjät?

source: No users
fi: Ei käyttäjiä

source: External test users available for this SP
fi: Ulkopuoliset testikäyttäjät, jotka voivat kirjautua tähän palveluun

source: These users are keyed to some other SP but have also been activated for this SP by a user who has admin rights for both SPs.
fi: Nämä käyttäjät on lisätty johonkin toiseen palveluun, mutta ne on hyväksytty myös tähän palveluun sellaisen ylläpitäjän toimesta, jolla on oikeudet molempiin palveluihin.

source: Do you want to remove selected external test users?
fi: Haluatko poistaa valitut ulkopuoliset testikäyttäjät?

source: Add a test user
fi: Lisää testikäyttäjä

source: Test user
fi: Testikäyttäjä

source: Listing all attributes requested by this service provider.
fi: Näytetään kaikki attribuutit, joita tämä palvelu pyytää.

source: Update
fi: Päivitä

source: Attribute values
fi: Attribuuttien arvot

source: Multiple values can be separated by semicolon. If you don't find the attribute here, please check that the attribute is enabled for this SP in the Attributes page.
fi: Useampia arvoja voidaan antaa erottamalla ne puolipisteellä. Jos et löydä attribuuttia täältä, varmista että attribuutti on lisätty palveluun Attribuutit-sivulla.

source: Reset name based data
fi: Palauta nimipohjaiset arvot

source: Reset other data with random values
fi: Arvo muut arvot uudelleen

source: User Groups published via LDAP.
fi: Käyttäjäryhmät, jotka julkaistaan LDAPin kautta.

source: List of user groups
fi: Lista käyttäjäryhmistä

source: Do you want to remove selected user groups?
fi: Haluatko poistaa valitut käyttäjäryhmät?

source: No user groups
fi: Ei käyttäjäryhmiä

source: Add user group
fi: Lisää käyttäjäryhmä

source: Could not add attribute
fi: Ei voitu lisätä attribuuttia

source: Name already exists, skipping
fi: Nimi on jo olemassa, jätetään väliin

source: Name already exists, overwriting
fi: Nimi on jo olemassa, ylikirjoitetaan

source: Name does not exist, creating
fi: Nimeä ei löydy, luodaan

source: Could not find name
fi: Ei voitu löytää nimeä

source: Technical contact
fi: Tekninen yhteystieto

source: Could not add certificate
fi: Ei voitu lisätä varmennetta

source: Unsupported nameid-format
fi: Ei tuettu nameid-muoto

source: Unsupported binding, please contact IdP admins if you really need this
fi: Ei tuettu yhteysosoitemuoto. Ota yhteyttä IdP-ylläpitäjiin, jos oikeasti tarvitset tätä.

source: Could not add
fi: Ei voitu lisätä

source: EntityID already exists, skipping
fi: EntityID jo olemassa, jätetään väliin

source: EntityID already exists, overwriting
fi: EntityID jo olemassa, ylikirjoitetaan

source: EntityID does not exist, creating
fi: EntityID:tä ei löytynyt, luodaan

source: Service provider does not exist
fi: Palvelua ei löytynyt

source: Attributes added:
fi: Attribuutti lisätty:

source: Attributes modified:
fi: Attribuuttia muokattu:

source: Attributes removed:
fi: Attribuutti poistettu:

source: Attribute provided does not exist
fi: Attribuuttia ei löytynyt

source: Attribute test service has been disabled
fi: Attribuuttien testipalvelu on suljettu

source: Certificate added.
fi: Varmenne lisätty.

source: Could not add certificate.
fi: Ei voitu lisätä varmennetta.

source: Certificate removed:
fi: Varmenne poistettu:

source: Certificate provided does not exist
fi: Varmennetta ei ole olemassa

source: Contact added.
fi: Yhteystieto lisätty.

source: Contact removed.
fi: Yhteystieto poistettu

source: Email have been sent
fi: Sähköpostit lähetetty

source: Endpoint added.
fi: Yhteysosoite lisätty.

source: Endpoint removed.
fi: Yhteysosoite poistettu.

source: Redirection loop for authenticated user detected. Check that your LOGIN_REDIRECT_URL doesn't point to a login page.
fi: Uudelleenohjaussilmukka havaittu autentikoinnissa. Tarkista, ettei LOGIN_REDIRECT_URL osoita kirjautumissivulle.

source: Your user account has been deactivated.
fi: Käyttäjätilisi on suljettu

source: Git repository appears to have an invalid format.
fi: Git-repositorio vaikuttaisi olevan väärässä muodossa.

source: Repository path could not be accessed.
fi: Repositorion sijaintia ei voitu lukea.

source: Execution of git command failed. Might want to try git command locally from the command line and check that it works.
fi: git-komennon suorittaminen epäonnistui. Kannattaa tarkastaa komentorivillä, että se toimii oikein.

source: Git repository has no origin.
fi: Git-repositoriolla ei ole lähdettä

source: Remote repository not matching local, please fix manually.
fi: Ulkoinen repositorio ei vastaa paikallista, korjaa tämä käsin.

source: Pushing to remote did not work, please fix manually.
fi: Tietojen vienti ulkoiseen repositorioon ei toiminut, korjaa tämä käsin.

source: Execution of git command failed. Might want to try git command locally from the command line and check that it works.
fi: git-komennon suorittaminen epäonnistui. Kannattaa tarkastaa komentorivillä, että se toimii oikein.

source: Metadata file has changed, please try again.
fi: Metatiedot ovat muuttuneet, tarkasta muutokset ja yritä uudelleen.

source: Redirect URL added.
fi: Paluuosoite lisätty

source: Redirect URL removed.
fi: Paluuosoite poistettu.

source: Changes validated.
fi: Muutokset hyväksytty.

source: You should not be here.
fi: Sinun ei kuuluisi olla täällä.

source: Form successfully saved
fi: Lomake tallennettu

source: Client secret generated.
fi: Palvelun salaisuus luotu

source: Unable to generate a client secret. Usually this means incorrect server configuration.
fi: Ei voitu luoda palvelun salaisuutta. Yleensä tämä merkitsee virheellisiä palvelinasetuksia.

source: Client secret removed.
fi: Palvelun salaisuus poistettu

source: Service deleted.
fi: Palvelu poistettu.

source: Service removal is not allowed for production services.
fi: Tuotantopalvelun poisto ei ole sallittua.

source: Template is missing activation link. Please include {{ activation_link }} to message.
fi: Viestipohjasta puuttuu aktivointilinkki. Lisää {{ activation_link }} viestiin.

source: Admin group added:
fi: Ylläpitoryhmä lisätty:

source: Admin group removed:
fi: Ylläpitoryhmä poistettu:

source: Invite sent to
fi: Kutsu lähetetty osoitteeseen

source: Could not send email.
fi: Ei voitu lähettää sähköpostia.

source: Invalid header found, could not send email.
fi: Virheellinen otsikko löydetty, ei voitu lähettää sähköpostia.

source: Invite removed for email
fi: Kutsu poistettu sähköpostiosoitteelta

source: Invite already used or removed
fi: Kutsu on jo käytetty tai poistettu

source: Admin removed:
fi: Ylläpitäjä poistettu:

source: Activation key does not match
fi: Aktivointiavain ei vastaa

source: Test user added:
fi: Testikäyttäjä lisätty:

source: Username already exists:
fi: Käyttäjänimi on jo olemassa:

source: Test user removed:
fi: Testikäyttäjä poistettu:

source: External test user removed:
fi: Ulkopuolinen testikäyttäjä poistettu:

source: Test user does not exist or you don't have permission to view it
fi: Testikäyttäjää ei löydy tai käyttöoikeutenne eivät riitä sen näyttämiseen.

source: Name based data reset for test user:
fi: Nimipohjaiset arvot palautettu testikäyttäjälle:

source: User data reset for test user:
fi: Testikäyttäjän arvot palautettu:

source: Test user attributes updated:
fi: Testikäyttäjän arvot päivitetty:

source: User info updated:
fi: Käyttäjätiedot päivitetty:

source: User group added.
fi: Käyttäjäryhmä lisätty.

source: User group removed.
fi: Käyttäjäryhmä poistettu.
